#+TITLE: C++ 中的拷贝控制
#+DATE: <2020-07-09 Thu 15:07>
#+LAYOUT: post
#+TAGS: C++
#+CATEGORIES: C++

#+HTML: <!-- more -->

一般来说进行资源管理的类都需要对拷贝过程进行控制，另外在类需要进行某些记录操作时
也需要进行拷贝控制。以博客生成为例，一篇博客可能具有多个标签，而一个标签下面也会
管理多篇博客。

** 测试我们的 =Blog= 和 =Tag= 类

#+begin_src C++ :file-name foo.cc :noweb eval :flags -lfmt
  #include <fmt/core.h>

  <<Tag-class>>
  <<Blog-class>>

  std::ostream& operator<<(std::ostream& os, Tag const& tag)
  {
    os << fmt::format("Tag({0}) has {1} blogs:\n", tag.name, tag.blogs.size());
    std::set<Blog*>::size_type index = 0;
    std::set<Blog*>::const_iterator iter = tag.blogs.cbegin();
    for (; index < tag.blogs.size(); ++index, ++iter) {
      os << fmt::format("[{0}] ", index + 1) << (*iter)->get_content() << std::endl;
    }
    return os;
  }

  std::ostream& operator<<(std::ostream& os, Blog const& blog)
  {
    os << fmt::format("Blog({0}) has {1} tags: ", blog.content, blog.tags.size());
    std::set<Tag*>::size_type index = 0;
    std::set<Tag*>::const_iterator iter = blog.tags.cbegin();
    for (; index < blog.tags.size() - 1; ++index, ++iter)
      os << (*iter)->get_name() << ", ";
    return os << (*iter)->get_name() << "." << std::endl;
  }

  int main()
  {
    Tag python("Python"), cpp("C++"), program("Program languages");

    Blog b1("Python is elegant.");
    Blog b2("Python is simple.");
    Blog b3("C++ is evil.");
    b1.add_to(python);
    b2.add_to(python);
    b3.add_to(cpp);
    b1.add_to(program);
    b2.add_to(program);
    b3.add_to(program);

    std::cout << python << std::endl;
    std::cout << cpp << std::endl;
    std::cout << program << std::endl;

    // 从 b3 拷贝构造 b4
    Blog b4(b3);
    std::cout << cpp << std::endl;
    std::cout << b4 << std::endl;

    b4 = b1;
    std::cout << cpp << std::endl;
    std::cout << python << std::endl;
    std::cout << b4 << std::endl;
  }
#+end_src

#+RESULTS[3489448fa7ac0d19b2ff4339860bd1ca462830e9]:
#+begin_example
Tag(Python) has 2 blogs:
[1] Python is elegant.
[2] Python is simple.

Tag(C++) has 1 blogs:
[1] C++ is evil.

Tag(Program languages) has 3 blogs:
[1] Python is elegant.
[2] Python is simple.
[3] C++ is evil.

Tag(C++) has 2 blogs:
[1] C++ is evil.
[2] C++ is evil.

Blog(C++ is evil.) has 2 tags: C++, Program languages.

Tag(C++) has 1 blogs:
[1] C++ is evil.

Tag(Python) has 3 blogs:
[1] Python is elegant.
[2] Python is simple.
[3] Python is elegant.

Blog(Python is elegant.) has 2 tags: Python, Program languages.
#+end_example
